{
	"version": "https://jsonfeed.org/version/1",
	"title": "meta on KTamas' Blog",
	"description": "An ongoing list of KTamas' Blog posts about meta",
	"home_page_url": "https://blog.ktamas.com/tags/meta/",
	"feed_url": "https://blog.ktamas.com/tags/meta/feed.json",
	"icon": "https://blog.ktamas.com/icon-512x512.png",
	"favicon": "https://blog.ktamas.com/icon-64x64.png",
	"author": {
		"name": "KTamas",
		"url": "https://blog.ktamas.com/"
	},
	"items": [
		{
			"id": "https://blog.ktamas.com/index.php/2019/02/01/converting-my-blog-to-hugo-and-getting-rid-of-my-vps/",
			"url": "https://blog.ktamas.com/index.php/2019/02/01/converting-my-blog-to-hugo-and-getting-rid-of-my-vps/",
			"title": "Converting My Blog To Hugo and Getting Rid of My VPS",
			"date_published": "2019-02-01T11:46:09Z",
			"author": {
				"name": "KTamas",
				"url": "https://blog.ktamas.com/"
			},
			"tags": ["meta","tech","hugo","writetogether"],
			"content_html": "\u003cp\u003e\u003ca href=\"https://blog.ktamas.com\"\u003eI have a blog\u003c/a\u003e (you\u0026rsquo;re reading it!). It\u0026rsquo;s got history: I set it up in early 2009, and I have almost 600 posts, mostly in Hungarian. I had one before that, between 2005 and 2008, but it was lost due to a variety of reasons, including my failure to properly back things up. Small bits of it are still \u003ca href=\"http://web.archive.org/web/20070208165650/http://blog.ktamas.com/\"\u003eup in the Wayback Machine\u003c/a\u003e, though. It was all in Wordpress, which does its job, though even in 2019 it can be a pain to update things.\u003c/p\u003e\n\n\u003ch3 id=\"from-wordpress-to-jekyll-to-hugo\"\u003eFrom Wordpress to Jekyll to Hugo\u003c/h3\u003e\n\n\u003cp\u003eAbout a week ago I decided it was time to migrate it to \u003ca href=\"https://jekyllrb.com/\"\u003eJekyll\u003c/a\u003e. I was bored, and it gave me a good excuse to play with a static site generator. Plus, doing this kind of conversion became a rite of passage for people working in tech these days.\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003eThis is not a complete guide; you can find hundreds of them with a \u003ca href=\"https://www.google.com/search?q=convert+wordpress+to+jekyll\"\u003equick google\u003c/a\u003e. I will, however, provide a general overview of the process with some helpful pointers and links.\u003c/em\u003e\u003c/p\u003e\n\n\u003cp\u003eI started by migrating all the comments to Disqus with their \u003ca href=\"https://wordpress.org/plugins/disqus-comment-system/\"\u003eofficial Wordpress plugin\u003c/a\u003e. After that, I used a \u003ca href=\"https://wordpress.org/plugins/jekyll-exporter/\"\u003eJekyll exporter plugin\u003c/a\u003e that converted all my posts into markdown\u0026hellip; except it stripped all the embeds.\u003c/p\u003e\n\n\u003cp\u003eI used to blog a lot about music, so I had a lot of embeds, mostly from Youtube. In retrospect, I could have saved myself some time by patching the exporter or finding another one. In the end, however, I ended up fixing every single post by hand. I replaced old, pre-iframe flash embed codes with updated ones and changed the newer, but still http ones to https. In most places, if the video was not necessary or wasn\u0026rsquo;t available anymore, I added the song to the post via Spotify. The chances of a given song being up on Spotify in a few years feels \u003cem\u003emarginally\u003c/em\u003e higher than on Youtube right now. I had a few other embeds that I could fix with newer code (Soundcloud) and others that I couldn\u0026rsquo;t (Deezer), but most of the time I could find the given song or playlist within Spotify. All of this had the benefit of walking down on memory lane, reading 10-year old blog posts and cringing a lot. \u003cem\u003eI was so young.\u003c/em\u003e\u003c/p\u003e\n\n\u003chr /\u003e\n\n\u003cp\u003eI\u0026rsquo;ve found a \u003ca href=\"https://github.com/vinitkumar/white-paper\"\u003ereasonably decent theme\u003c/a\u003e for Jekyll, which felt like a good starting point, though it didn\u0026rsquo;t have built-in support for tags or archives. I started googling how to implement that, and around the same time I was venting about my embed issues on the XOXO slack. That was when \u003ca href=\"https://twitter.com/theory\"\u003eDavid\u003c/a\u003e chimed in about his experiences on doing this exact same process, except he ended up using \u003ca href=\"https://gohugo.io\"\u003eHugo\u003c/a\u003e, another popular static site generator that\u0026rsquo;s kind of like Jekyll except faster. \u003ca href=\"https://github.com/theory/justatheory/tree/master/themes/justatheory\"\u003eThe theme\u003c/a\u003e of \u003ca href=\"https://justatheory.com\"\u003ehis blog\u003c/a\u003e had everything I wanted: a fancy archives page and proper support for tags. So I figured I might as well continue my journey: switch to Hugo and use his theme as a basis.\u003c/p\u003e\n\n\u003cp\u003eJekyll is written in Ruby and uses a simple templating language. Hugo\u0026rsquo;s code is in Go, and it uses Go\u0026rsquo;s own templates; they definitely have a learning curve, even if you have coded in Go before. With some help, googling and a lot of trial and error, I got the hang of it and managed to change things to my liking as well as the look and the color scheme of the site. I converted most of my posts\u0026rsquo; \u003ca href=\"https://gohugo.io/content-management/front-matter/\"\u003efront matter\u003c/a\u003e \u003ca href=\"https://github.com/coderzh/ConvertToHugo\"\u003ewith a script\u003c/a\u003e and fixed the rest with a few search-and-replaces. With 8-10 hours of work behind me — half of that was fixing those embeds — I had my new blog ready to be \u003ca href=\"https://pages.github.com/\"\u003ehosted on Github Pages for free\u003c/a\u003e. I use a modified version of the \u003ca href=\"https://gohugo.io/hosting-and-deployment/hosting-on-github/#put-it-into-a-script-1\"\u003esample deploy script\u003c/a\u003e they have in Hugo\u0026rsquo;s documentation.\u003c/p\u003e\n\n\u003ch3 id=\"getting-rid-of-my-vps\"\u003eGetting Rid of My VPS\u003c/h3\u003e\n\n\u003cp\u003eI had a small VPS at Linode for years now, hosting my pet projects, my blog and a bunch of static sites (like my \u003ca href=\"https://ktamas.com\"\u003ehome page\u003c/a\u003e) over the years. It also had OpenVPN installed so I could watch iPlayer for free until BBC started cracking down on that. By now it only had my blog and those static sites; I figured if I could find something for the latter, I could ditch the VPS entirely.\u003c/p\u003e\n\n\u003cp\u003eI don\u0026rsquo;t remember how, but I came across \u003ca href=\"https://netlify.com\"\u003eNetlify\u003c/a\u003e. They give you free static hosting with extremely generous soft limits (100 gigs of storage, 100 GB/month transfer). You just point them to a Github repository, and about 30 seconds later you have your site ready, with support for multiple custom domains and SSL.\u003c/p\u003e\n\n\u003cp\u003eI spent an hour or two moving everything to Netlify, changing the necessary DNS entries and in the end, I was ready to say goodbye to my VPS and save a grand total of $7 a month in the future. I made backups of everything and then, somewhat emotionally pressed the \u0026ldquo;Delete\u0026rdquo; button on Linode\u0026rsquo;s control panel. I wouldn\u0026rsquo;t be surprised if I would get another one eventually for a side project or something, but for now, I\u0026rsquo;m happy with my all my stuff hosted around the internet for free and stored in git repos.\u003c/p\u003e\n\n\u003ch3 id=\"on-the-future-of-my-blog\"\u003eOn the Future of My Blog\u003c/h3\u003e\n\n\u003cp\u003eMaking this move also means that I will start cross-posting my posts from \u003ca href=\"https://writetogether.space/users/ktamas\"\u003eWriteTogether\u003c/a\u003e to here. One-off posts like this one will definitely make it here; the ongoing series I have at WriteTogether will probably stay there until they are done, and then I\u0026rsquo;ll re-edit them into long-form posts and publish them here. I will also post content here that doesn\u0026rsquo;t fit WriteTogether for one reason or another. Feel free to \u003ca href=\"http://feeds.feedburner.com/KTamasBlog\"\u003esubscribe to this blog\u003c/a\u003e in your favorite RSS reader.\u003c/p\u003e\n\n\u003cp\u003eHugo gives me a lot of ways to tinker; I am already thinking about replacing the commenting system, adding reading time, word count and so on. I might write something on this in again in the future.\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003eThis post was not sponsored by anyone, just in case some of it reads like an ad for Github or Netlify or whatever.\u003c/em\u003e\u003c/p\u003e\n\n\u003cfooter\u003e\n    \u003ca title=\"Permanent link to “Converting My Blog To Hugo and Getting Rid of My VPS”\" href=\"https://blog.ktamas.com/index.php/2019/02/01/converting-my-blog-to-hugo-and-getting-rid-of-my-vps/\"\u003e\u0026nbsp;\u0026nbsp;\u003c/a\u003e\n    By KTamas for \u003ca href=\"https://blog.ktamas.com/\"\u003eKTamas\u0026#39; Blog\u003c/a\u003e\n        \u003cdiv class=\"tags\"\u003e\n            \u003ch5\u003eMore about…\u003c/h5\u003e\n            \u003cul\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/meta/\"\u003emeta\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/tech/\"\u003etech\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/hugo/\"\u003ehugo\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/writetogether/\"\u003ewritetogether\u003c/a\u003e\u003c/li\u003e\n            \u003c/ul\u003e\n        \u003c/div\u003e\n\u003c/footer\u003e",
			"content_text": "[I have a blog](https://blog.ktamas.com) (you're reading it!). It's got history: I set it up in early 2009, and I have almost 600 posts, mostly in Hungarian. I had one before that, between 2005 and 2008, but it was lost due to a variety of reasons, including my failure to properly back things up. Small bits of it are still [up in the Wayback Machine](http://web.archive.org/web/20070208165650/http://blog.ktamas.com/), though. It was all in Wordpress, which does its job, though even in 2019 it can be a pain to update things.\n\n### From Wordpress to Jekyll to Hugo\n\nAbout a week ago I decided it was time to migrate it to [Jekyll](https://jekyllrb.com/). I was bored, and it gave me a good excuse to play with a static site generator. Plus, doing this kind of conversion became a rite of passage for people working in tech these days.\n\n*This is not a complete guide; you can find hundreds of them with a [quick google](https://www.google.com/search?q=convert+wordpress+to+jekyll). I will, however, provide a general overview of the process with some helpful pointers and links.*\n\nI started by migrating all the comments to Disqus with their [official Wordpress plugin](https://wordpress.org/plugins/disqus-comment-system/). After that, I used a [Jekyll exporter plugin](https://wordpress.org/plugins/jekyll-exporter/) that converted all my posts into markdown... except it stripped all the embeds.\n\nI used to blog a lot about music, so I had a lot of embeds, mostly from Youtube. In retrospect, I could have saved myself some time by patching the exporter or finding another one. In the end, however, I ended up fixing every single post by hand. I replaced old, pre-iframe flash embed codes with updated ones and changed the newer, but still http ones to https. In most places, if the video was not necessary or wasn't available anymore, I added the song to the post via Spotify. The chances of a given song being up on Spotify in a few years feels *marginally* higher than on Youtube right now. I had a few other embeds that I could fix with newer code (Soundcloud) and others that I couldn't (Deezer), but most of the time I could find the given song or playlist within Spotify. All of this had the benefit of walking down on memory lane, reading 10-year old blog posts and cringing a lot. *I was so young.*\n\n---\n\nI've found a [reasonably decent theme](https://github.com/vinitkumar/white-paper) for Jekyll, which felt like a good starting point, though it didn't have built-in support for tags or archives. I started googling how to implement that, and around the same time I was venting about my embed issues on the XOXO slack. That was when [David](https://twitter.com/theory) chimed in about his experiences on doing this exact same process, except he ended up using [Hugo](https://gohugo.io), another popular static site generator that's kind of like Jekyll except faster. [The theme](https://github.com/theory/justatheory/tree/master/themes/justatheory) of [his blog](https://justatheory.com) had everything I wanted: a fancy archives page and proper support for tags. So I figured I might as well continue my journey: switch to Hugo and use his theme as a basis.\n\nJekyll is written in Ruby and uses a simple templating language. Hugo's code is in Go, and it uses Go's own templates; they definitely have a learning curve, even if you have coded in Go before. With some help, googling and a lot of trial and error, I got the hang of it and managed to change things to my liking as well as the look and the color scheme of the site. I converted most of my posts' [front matter](https://gohugo.io/content-management/front-matter/) [with a script](https://github.com/coderzh/ConvertToHugo) and fixed the rest with a few search-and-replaces. With 8-10 hours of work behind me — half of that was fixing those embeds — I had my new blog ready to be [hosted on Github Pages for free](https://pages.github.com/). I use a modified version of the [sample deploy script](https://gohugo.io/hosting-and-deployment/hosting-on-github/#put-it-into-a-script-1) they have in Hugo's documentation. \n\n### Getting Rid of My VPS\n\nI had a small VPS at Linode for years now, hosting my pet projects, my blog and a bunch of static sites (like my [home page](https://ktamas.com)) over the years. It also had OpenVPN installed so I could watch iPlayer for free until BBC started cracking down on that. By now it only had my blog and those static sites; I figured if I could find something for the latter, I could ditch the VPS entirely.\n\nI don't remember how, but I came across [Netlify](https://netlify.com). They give you free static hosting with extremely generous soft limits (100 gigs of storage, 100 GB/month transfer). You just point them to a Github repository, and about 30 seconds later you have your site ready, with support for multiple custom domains and SSL.\n\nI spent an hour or two moving everything to Netlify, changing the necessary DNS entries and in the end, I was ready to say goodbye to my VPS and save a grand total of $7 a month in the future. I made backups of everything and then, somewhat emotionally pressed the \"Delete\" button on Linode's control panel. I wouldn't be surprised if I would get another one eventually for a side project or something, but for now, I'm happy with my all my stuff hosted around the internet for free and stored in git repos.\n\n### On the Future of My Blog\n\nMaking this move also means that I will start cross-posting my posts from [WriteTogether](https://writetogether.space/users/ktamas) to here. One-off posts like this one will definitely make it here; the ongoing series I have at WriteTogether will probably stay there until they are done, and then I'll re-edit them into long-form posts and publish them here. I will also post content here that doesn't fit WriteTogether for one reason or another. Feel free to [subscribe to this blog](http://feeds.feedburner.com/KTamasBlog) in your favorite RSS reader.\n\nHugo gives me a lot of ways to tinker; I am already thinking about replacing the commenting system, adding reading time, word count and so on. I might write something on this in again in the future.\n\n*This post was not sponsored by anyone, just in case some of it reads like an ad for Github or Netlify or whatever.*\n\n-------------------------------------------------------------------------------\n\n Friday, 1 Feb 2019\nBy KTamas\nhttps://blog.ktamas.com/index.php/2019/02/01/converting-my-blog-to-hugo-and-getting-rid-of-my-vps/\n\nMore about...\n\n* meta:          https://blog.ktamas.com/tags/meta/\n* tech:          https://blog.ktamas.com/tags/tech/\n* hugo:          https://blog.ktamas.com/tags/hugo/\n* writetogether: https://blog.ktamas.com/tags/writetogether/"
		}, 
		{
			"id": "https://blog.ktamas.com/index.php/2011/04/30/koltozes-a-felhobe/",
			"url": "https://blog.ktamas.com/index.php/2011/04/30/koltozes-a-felhobe/",
			"title": "Koltozes a felhobe",
			"date_published": "2011-04-30T18:17:56Z",
			"author": {
				"name": "KTamas",
				"url": "https://blog.ktamas.com/"
			},
			"tags": ["énblog","linux","meta","programozás","szerverek"],
			"content_html": "\u003cp\u003eKet dolog tortent, az egyik, hogy mostanaban folyton elszallt a php-nginx kombo egyszercsak \u003ca href=\"http://blog.ktamas.com/index.php/2010/10/12/64-megabytes-should-be-enough-for-everyone/\"\u003ea 64 megas VPS-en\u003c/a\u003e, amit anno osszeraktam. Frissitettem, megneztem a konfigokat, megis, egyszercsak elhalt az egesz, kezzel kellett ujrarugni. A masik dolog, ami tortent, hogy mikor tegnap este ismetelten kaptam a pingdomtol emailt, hogy \u0026#8220;DOWN alert: blog (blog.ktamas.com) is DOWN\u0026#8221;, akkor azt mondtam, hogy oke, eljatszotta az utolso lehetoseget is a helyzet, holnap (azaz ma) uj VPS-t keresunk.\u003c/p\u003e\n\n\u003cp\u003eAzaz, kerestunk volna, mert ma reggel kaptam egy emailt, ami igy kezdodott:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e\u0026#8220;You have been selected to enter the PHP Fog Beta program!\u0026#8221;\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eA masik dolog, ugyanis ami mostanaban tortent, az az volt, hogy egyre-masra bukkannak fel a \u003ca href=\"http://news.ycombinator.com/\"\u003ehacker news\u003c/a\u003eon \u003ca href=\"http://www.heroku.com/\"\u003eHeroku\u003c/a\u003e-szeru cloudos PaaS-ok (Platform as a Service), eloszor talan pythonhoz-djangohoz, majd kesobb mindenfele mas programnyelv/framework/egyeb kombohoz. Mint anno a betas Heroku, ok is altalaban ingyenes betakra epulnek, hogy az emberek jol kibetatesztelik az ingyenes/olcso szolgaltatasert cserebe az egeszet. Raadasul a deployment szinte kivetel nelkul giten keresztul megy, ami iszonyat kenyelmesse teszi a dolgot, mostanaban egyre tobb projekten dolgozok amihez amugyis azt hasznalom (\u003ca href=\"http://www.github.com/ktamas/\"\u003eitt a githubom\u003c/a\u003e, nem disznolab). De eloreszaladok, ez egy masik blogposzt temaja lesz, remelhetoleg hamarosan.\u003c/p\u003e\n\n\u003cp\u003eSzoval kaptam PHP Fog betat, amire miert is ne alapon bejelentkeztem meg circa szuk ket honapja, megcsinaltam az accountot, csinaltam egy uj wordpress appot (fel evig ingyenes a legkisebb csomagban, aztan majd meglatjuk), kidumpoltam az adatbazist a regi szerveren, kimasoltam a gepemre a regi wordpress mappammal egyutt, git-cloneoztam a repot arrol az URL-rol, amit a PHP Fog adott nekem, felulirtam a wp-content mappat a regivel, behuztam PhpMyAdminbol a regi adatbazist, eeees\u0026#8230; futottam meg egy kort a supporttal, mert hiaba pusholtam a szerverre, hiaba mondta h sikeres, a friss wordpress telepites nem nagyon latta a repoba rakott fajlokat. Mindenesetre dicseretes, hogy a szupportosok szombat ellenere par ora alatt valaszoltak es megjavitottak a helyzetet, atraktam a domain A-rekordjat, ujraimportaltam a DB-t mert azota irtam egy posztot, es most meg eppen ezt irom.\u003c/p\u003e\n\n\u003cp\u003eA felho tehat borzasztoan kenyelmesse tesz dolgokat, ami persze nem jelenti azt, a helyzet felhotlen lenne (elnezest), az elmult napokban is voltak erre peldak, ugye, mindenesetre programozooldalrol tenyleg iszonyat kenyelmesse tesz dolgokat, hogy (kis tulzassal) git push, es szevasztok. A bennem levo controlfreak rendszergazda most epp el van tehat nyomva, de biztos ki fog jonni egyszercsak\u0026#8230;\u003c/p\u003e\n\n\u003cfooter\u003e\n    \u003ca title=\"Permanent link to “Koltozes a felhobe”\" href=\"https://blog.ktamas.com/index.php/2011/04/30/koltozes-a-felhobe/\"\u003e\u0026nbsp;\u0026nbsp;\u003c/a\u003e\n    By KTamas for \u003ca href=\"https://blog.ktamas.com/\"\u003eKTamas\u0026#39; Blog\u003c/a\u003e\n        \u003cdiv class=\"tags\"\u003e\n            \u003ch5\u003eMore about…\u003c/h5\u003e\n            \u003cul\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/%C3%A9nblog/\"\u003eénblog\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/linux/\"\u003elinux\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/meta/\"\u003emeta\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/programoz%C3%A1s/\"\u003eprogramozás\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/szerverek/\"\u003eszerverek\u003c/a\u003e\u003c/li\u003e\n            \u003c/ul\u003e\n        \u003c/div\u003e\n\u003c/footer\u003e",
			"content_text": "Ket dolog tortent, az egyik, hogy mostanaban folyton elszallt a php-nginx kombo egyszercsak [a 64 megas VPS-en](http://blog.ktamas.com/index.php/2010/10/12/64-megabytes-should-be-enough-for-everyone/), amit anno osszeraktam. Frissitettem, megneztem a konfigokat, megis, egyszercsak elhalt az egesz, kezzel kellett ujrarugni. A masik dolog, ami tortent, hogy mikor tegnap este ismetelten kaptam a pingdomtol emailt, hogy \u0026#8220;DOWN alert: blog (blog.ktamas.com) is DOWN\u0026#8221;, akkor azt mondtam, hogy oke, eljatszotta az utolso lehetoseget is a helyzet, holnap (azaz ma) uj VPS-t keresunk. \n\nAzaz, kerestunk volna, mert ma reggel kaptam egy emailt, ami igy kezdodott:\n\n\u003e \u0026#8220;You have been selected to enter the PHP Fog Beta program!\u0026#8221;\n\nA masik dolog, ugyanis ami mostanaban tortent, az az volt, hogy egyre-masra bukkannak fel a [hacker news](http://news.ycombinator.com/)on [Heroku](http://www.heroku.com/)-szeru cloudos PaaS-ok (Platform as a Service), eloszor talan pythonhoz-djangohoz, majd kesobb mindenfele mas programnyelv/framework/egyeb kombohoz. Mint anno a betas Heroku, ok is altalaban ingyenes betakra epulnek, hogy az emberek jol kibetatesztelik az ingyenes/olcso szolgaltatasert cserebe az egeszet. Raadasul a deployment szinte kivetel nelkul giten keresztul megy, ami iszonyat kenyelmesse teszi a dolgot, mostanaban egyre tobb projekten dolgozok amihez amugyis azt hasznalom ([itt a githubom](http://www.github.com/ktamas/), nem disznolab). De eloreszaladok, ez egy masik blogposzt temaja lesz, remelhetoleg hamarosan.\n\nSzoval kaptam PHP Fog betat, amire miert is ne alapon bejelentkeztem meg circa szuk ket honapja, megcsinaltam az accountot, csinaltam egy uj wordpress appot (fel evig ingyenes a legkisebb csomagban, aztan majd meglatjuk), kidumpoltam az adatbazist a regi szerveren, kimasoltam a gepemre a regi wordpress mappammal egyutt, git-cloneoztam a repot arrol az URL-rol, amit a PHP Fog adott nekem, felulirtam a wp-content mappat a regivel, behuztam PhpMyAdminbol a regi adatbazist, eeees\u0026#8230; futottam meg egy kort a supporttal, mert hiaba pusholtam a szerverre, hiaba mondta h sikeres, a friss wordpress telepites nem nagyon latta a repoba rakott fajlokat. Mindenesetre dicseretes, hogy a szupportosok szombat ellenere par ora alatt valaszoltak es megjavitottak a helyzetet, atraktam a domain A-rekordjat, ujraimportaltam a DB-t mert azota irtam egy posztot, es most meg eppen ezt irom.\n\nA felho tehat borzasztoan kenyelmesse tesz dolgokat, ami persze nem jelenti azt, a helyzet felhotlen lenne (elnezest), az elmult napokban is voltak erre peldak, ugye, mindenesetre programozooldalrol tenyleg iszonyat kenyelmesse tesz dolgokat, hogy (kis tulzassal) git push, es szevasztok. A bennem levo controlfreak rendszergazda most epp el van tehat nyomva, de biztos ki fog jonni egyszercsak\u0026#8230;\n\n-------------------------------------------------------------------------------\n\n Saturday, 30 Apr 2011\nBy KTamas\nhttps://blog.ktamas.com/index.php/2011/04/30/koltozes-a-felhobe/\n\nMore about...\n\n* énblog:      https://blog.ktamas.com/tags/%C3%A9nblog/\n* linux:       https://blog.ktamas.com/tags/linux/\n* meta:        https://blog.ktamas.com/tags/meta/\n* programozás: https://blog.ktamas.com/tags/programoz%C3%A1s/\n* szerverek:   https://blog.ktamas.com/tags/szerverek/"
		}
	]
}
