{
	"version": "https://jsonfeed.org/version/1",
	"title": "tech on KTamas' blog",
	"description": "An ongoing list of KTamas' blog posts about tech",
	"home_page_url": "https://blog.ktamas.com/tags/tech/",
	"feed_url": "https://blog.ktamas.com/tags/tech/feed.json",
	"icon": "https://blog.ktamas.com/icon-512x512.png",
	"favicon": "https://blog.ktamas.com/icon-64x64.png",
	"author": {
		"name": "KTamas",
		"url": "https://blog.ktamas.com/"
	},
	"items": [
		{
			"id": "https://blog.ktamas.com/index.php/2019/01/01/a-year-in-smartphones/",
			"url": "https://blog.ktamas.com/index.php/2019/01/01/a-year-in-smartphones/",
			"title": "A Year in Smartphones",
			"date_published": "2019-01-01T16:00:02Z",
			"author": {
				"name": "KTamas",
				"url": "https://blog.ktamas.com/"
			},
			"tags": ["tech","phones","writetogether"],
			"content_html": "\u003cp\u003eI started 2018 with wanting to try Android after not using it for like five years; I had a Nexus S with Android 4 point something back in 2013 before jumping on to the iPhone bandwagon. So I got myself a cheap Moto G5 Plus just to play around with it, and to my surprise, I promptly fell in love with the whole thing.\u003c/p\u003e\n\n\u003cp\u003eAndroid has come a long way, and in many ways, it\u0026rsquo;s a better fit for me than iOS. I like the (relative) openness of it, the way it handles notifications, the ability to turn off animations (I hate UI animations with a passion), the customizability in general, better integration with Google and so on. The G5 Plus shipped with 7.0 Nougat, with the promise of an Oreo upgrade coming in late 2017, which arrived at the end of 2018 and made an otherwise fast phone somewhat slow. It ships with a vanilla version of Android, with a few enhancements from Motorola that are actually useful: a few gestures (for example, shake twice for flashlight) and a really good implementation of an active display (you can preview and even dismiss notifications from it very quickly). Oh and it had a great battery life.\u003c/p\u003e\n\n\u003cp\u003eThe phone did have one major flaw: the camera sucks. It\u0026rsquo;s\u0026hellip; passable at best, but even with the best daylight conditions, pictures simple look off at best, because of Motorola applying some extremely aggressive sharpening. Low-light performance? What low-light performance?\u003c/p\u003e\n\n\u003cp\u003eSo I replaced it with a Pixel 2 which, at the time had the best camera on the market (it still is one of the best ones) and it was pretty great, except the GPS in it was pretty shitty, and I was used to using my phones for running. After it spending literally months in repair \u0026ndash; which is hard in a country where you can only buy grey market imports; mine is from Canada \u0026ndash;, going back and forth and getting nowhere, I just got fed up with the whole thing and sold it. Only later I learned that many of the high-end phones lately come with shitty GPSes and if you wanna go running, you better buy yourself a running watch.\u003c/p\u003e\n\n\u003cp\u003eIn any case, I decided to jump back to iOS and got myself an iPhone X, about two months before the fall keynote. I figured I\u0026rsquo;d replace it with the new model when it comes out but the XS is a ridiculously incremental upgrade and I have no desire whatsoever to spend money upgrading. Maybe next fall.\u003c/p\u003e\n\n\u003cp\u003eThe X also has a good camera, and the optical 2x zoom should be mandatory on phones; its portrait mode is, in my experience, ever-so-slightly better than the Pixel 2\u0026rsquo;s (its low light performance, on the other hand, is miles behind). I shot a \u003ca href=\"http://facesofxoxo2018.tumblr.com\"\u003eseries of portraits with it on XOXO 2018\u003c/a\u003e, and I was pretty satisfied with the results.\u003c/p\u003e\n\n\u003cp\u003eI do miss Android, but I came to appreciate the big screen in a relatively small package \u0026ndash; I can still more or less use the X with one hand \u0026ndash; as well as the build quality. iOS 12 was a very welcome update as well with a few small things (faster animations! less waiting!).\u003c/p\u003e\n\n\u003cp\u003eAnd there are certain things that, even in 2018 are just better in my experience on an iPhone; small things, like the smoothness of the touchscreen and the handle of touch in general, or having a working implementation of auto-brightness that not even the Pixel 2 can get right.\u003c/p\u003e\n\n\u003cp\u003eOverall I am pretty happy with the X, and I will stick with it for the foreseeable future, even though I recently got myself a Pixel 2 again because I needed an ARCore-capable phone for AR game development.\u003c/p\u003e\n\n\u003cp\u003eThe moral of the story is that I have disposable income and I was bored. I am tempted to say that none of this stuff really matters but I spend a fair amount of time on my phone every day so\u0026hellip; it kinda does for me.\u003c/p\u003e\n\n\u003cp\u003eThis post originally appeared on \u003ca href=\"https://writetogether.space/posts/5/a-year-in-smartphones\"\u003eWriteTogether\u003c/a\u003e.\u003c/p\u003e\n\n\u003cfooter\u003e\n    \u003ca title=\"Permanent link to “A Year in Smartphones”\" href=\"https://blog.ktamas.com/index.php/2019/01/01/a-year-in-smartphones/\"\u003e\u0026nbsp;\u0026nbsp;\u003c/a\u003e\n    By KTamas for \u003ca href=\"https://blog.ktamas.com/\"\u003eKTamas\u0026#39; blog\u003c/a\u003e\n        \u003cdiv class=\"tags\"\u003e\n            \u003ch5\u003eMore about…\u003c/h5\u003e\n            \u003cul\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/tech/\"\u003etech\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/phones/\"\u003ephones\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/writetogether/\"\u003ewritetogether\u003c/a\u003e\u003c/li\u003e\n            \u003c/ul\u003e\n        \u003c/div\u003e\n\u003c/footer\u003e",
			"content_text": "I started 2018 with wanting to try Android after not using it for like five years; I had a Nexus S with Android 4 point something back in 2013 before jumping on to the iPhone bandwagon. So I got myself a cheap Moto G5 Plus just to play around with it, and to my surprise, I promptly fell in love with the whole thing.\n\nAndroid has come a long way, and in many ways, it's a better fit for me than iOS. I like the (relative) openness of it, the way it handles notifications, the ability to turn off animations (I hate UI animations with a passion), the customizability in general, better integration with Google and so on. The G5 Plus shipped with 7.0 Nougat, with the promise of an Oreo upgrade coming in late 2017, which arrived at the end of 2018 and made an otherwise fast phone somewhat slow. It ships with a vanilla version of Android, with a few enhancements from Motorola that are actually useful: a few gestures (for example, shake twice for flashlight) and a really good implementation of an active display (you can preview and even dismiss notifications from it very quickly). Oh and it had a great battery life.\n\nThe phone did have one major flaw: the camera sucks. It's... passable at best, but even with the best daylight conditions, pictures simple look off at best, because of Motorola applying some extremely aggressive sharpening. Low-light performance? What low-light performance?\n\nSo I replaced it with a Pixel 2 which, at the time had the best camera on the market (it still is one of the best ones) and it was pretty great, except the GPS in it was pretty shitty, and I was used to using my phones for running. After it spending literally months in repair -- which is hard in a country where you can only buy grey market imports; mine is from Canada --, going back and forth and getting nowhere, I just got fed up with the whole thing and sold it. Only later I learned that many of the high-end phones lately come with shitty GPSes and if you wanna go running, you better buy yourself a running watch.\n\nIn any case, I decided to jump back to iOS and got myself an iPhone X, about two months before the fall keynote. I figured I'd replace it with the new model when it comes out but the XS is a ridiculously incremental upgrade and I have no desire whatsoever to spend money upgrading. Maybe next fall.\n\nThe X also has a good camera, and the optical 2x zoom should be mandatory on phones; its portrait mode is, in my experience, ever-so-slightly better than the Pixel 2's (its low light performance, on the other hand, is miles behind). I shot a [series of portraits with it on XOXO 2018](http://facesofxoxo2018.tumblr.com), and I was pretty satisfied with the results.\n\nI do miss Android, but I came to appreciate the big screen in a relatively small package -- I can still more or less use the X with one hand -- as well as the build quality. iOS 12 was a very welcome update as well with a few small things (faster animations! less waiting!).\n\nAnd there are certain things that, even in 2018 are just better in my experience on an iPhone; small things, like the smoothness of the touchscreen and the handle of touch in general, or having a working implementation of auto-brightness that not even the Pixel 2 can get right.\n\nOverall I am pretty happy with the X, and I will stick with it for the foreseeable future, even though I recently got myself a Pixel 2 again because I needed an ARCore-capable phone for AR game development.\n\nThe moral of the story is that I have disposable income and I was bored. I am tempted to say that none of this stuff really matters but I spend a fair amount of time on my phone every day so... it kinda does for me.\n\nThis post originally appeared on [WriteTogether](https://writetogether.space/posts/5/a-year-in-smartphones).\n\n-------------------------------------------------------------------------------\n\n Tuesday, 1 Jan 2019\nBy KTamas\nhttps://blog.ktamas.com/index.php/2019/01/01/a-year-in-smartphones/\n\nMore about...\n\n* tech:          https://blog.ktamas.com/tags/tech/\n* phones:        https://blog.ktamas.com/tags/phones/\n* writetogether: https://blog.ktamas.com/tags/writetogether/"
		}, 
		{
			"id": "https://blog.ktamas.com/index.php/2011/11/04/internetmegosztas/",
			"url": "https://blog.ktamas.com/index.php/2011/11/04/internetmegosztas/",
			"title": "Internetmegosztás",
			"date_published": "2011-11-04T09:32:37Z",
			"author": {
				"name": "KTamas",
				"url": "https://blog.ktamas.com/"
			},
			"tags": ["random","tech"],
			"content_html": "\u003cp\u003eMit csinál az ember, ha elvágják az épületben a koaxot és hirtelen egy egész iroda marad internet nélkül? 40 ember nem tud éppen dolgozni, valamit muszáj kezdeni a helyzettel. Mobilnetünk van, és a céges routeren van külön USB port ennek \u0026#8212; de pont a mi modemünket nem támogatja. Pánikra azonban semmi ok: mobilnetet be a gépünkbe, fel vele az világhálóra, majd azt azt továbbosztjuk rögtön a gép hálókártyájára. Ezután a kábelmodem WAN portjából átdugjuk a hálókábelt a gépbe, és már csak a routernek kell megmondani, hogy az internetet DHCP-n kérje, és hirtelen az egész irodában újra van net. Távolról sem olyan gyors ugyan, mint 120 megabites UPC, de arra a fél órára tökéletes\u0026#8230;\u003c/p\u003e\n\n\u003cfooter\u003e\n    \u003ca title=\"Permanent link to “Internetmegosztás”\" href=\"https://blog.ktamas.com/index.php/2011/11/04/internetmegosztas/\"\u003e\u0026nbsp;\u0026nbsp;\u003c/a\u003e\n    By KTamas for \u003ca href=\"https://blog.ktamas.com/\"\u003eKTamas\u0026#39; blog\u003c/a\u003e\n        \u003cdiv class=\"tags\"\u003e\n            \u003ch5\u003eMore about…\u003c/h5\u003e\n            \u003cul\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/random/\"\u003erandom\u003c/a\u003e\u003c/li\u003e\n                \u003cli\u003e\u003ca href=\"https://blog.ktamas.com/tags/tech/\"\u003etech\u003c/a\u003e\u003c/li\u003e\n            \u003c/ul\u003e\n        \u003c/div\u003e\n\u003c/footer\u003e",
			"content_text": "Mit csinál az ember, ha elvágják az épületben a koaxot és hirtelen egy egész iroda marad internet nélkül? 40 ember nem tud éppen dolgozni, valamit muszáj kezdeni a helyzettel. Mobilnetünk van, és a céges routeren van külön USB port ennek \u0026#8212; de pont a mi modemünket nem támogatja. Pánikra azonban semmi ok: mobilnetet be a gépünkbe, fel vele az világhálóra, majd azt azt továbbosztjuk rögtön a gép hálókártyájára. Ezután a kábelmodem WAN portjából átdugjuk a hálókábelt a gépbe, és már csak a routernek kell megmondani, hogy az internetet DHCP-n kérje, és hirtelen az egész irodában újra van net. Távolról sem olyan gyors ugyan, mint 120 megabites UPC, de arra a fél órára tökéletes\u0026#8230;\n\n-------------------------------------------------------------------------------\n\n Friday, 4 Nov 2011\nBy KTamas\nhttps://blog.ktamas.com/index.php/2011/11/04/internetmegosztas/\n\nMore about...\n\n* random: https://blog.ktamas.com/tags/random/\n* tech:   https://blog.ktamas.com/tags/tech/"
		}
	]
}
